emacs/.config/emacs/config.org
#+author: Karolos Triantafyllou
#+title: Personal GNU Emacs Configuration
#+property: header-args:emacs-lisp :tangle ./init.el :mkdirp yes

* Table Of Contents                                                     :TOC:
- [[#emacs-initialization][Emacs Initialization]]
  - [[#startup-performance][Startup Performance]]
  - [[#package-manager][Package Manager]]
  - [[#settings][Settings]]
  - [[#emacs-startup-debugging][Emacs Startup Debugging]]
  - [[#keeping-the-folder-clean][Keeping The Folder Clean]]
  - [[#authentication][Authentication]]
  - [[#better-defaults][Better Defaults]]
- [[#ui-configuration][UI Configuration]]
  - [[#mouse-interface][Mouse Interface]]
  - [[#fonts][Fonts]]
  - [[#theme][Theme]]
  - [[#modeline][Modeline]]
  - [[#icons][Icons]]
- [[#minibuffer-completion][Minibuffer Completion]]
  - [[#vertico][Vertico]]
  - [[#marginalia][Marginalia]]
  - [[#orderless][Orderless]]
  - [[#consult][Consult]]
  - [[#embark][Embark]]
- [[#auto-completion][Auto-Completion]]
  - [[#company][Company]]
  - [[#company-box][Company Box]]
- [[#language-servers][Language Servers]]
  - [[#lsp][LSP]]
  - [[#built-in-packages][Built-in Packages]]
- [[#meson][Meson]]
- [[#file-management][File Management]]
  - [[#dired][Dired]]
- [[#buffer-management][Buffer management]]
  - [[#ibuffer][IBuffer]]
  - [[#imenu][IMenu]]
  - [[#move-text][Move Text]]
  - [[#auto-revert][Auto-revert]]
- [[#windows][Windows]]
  - [[#window][Window]]
  - [[#centered-window][Centered window]]
  - [[#switch-window][Switch Window]]
  - [[#winner][Winner]]
- [[#terminals][Terminals]]
  - [[#term][Term]]
  - [[#e-term][E-Term]]
  - [[#vterm][VTerm]]
  - [[#eshell][EShell]]
- [[#spelling][Spelling]]
  - [[#abbreviations][Abbreviations]]
  - [[#flyspell][Flyspell]]
  - [[#spell-checker][Spell Checker]]
  - [[#grammar-checker][Grammar Checker]]
- [[#programming-languages-and-tools][Programming Languages and Tools]]
  - [[#bash][Bash]]
  - [[#c][C++]]
  - [[#cmake][CMake]]
  - [[#csv][CSV]]
  - [[#json][JSON]]
  - [[#stylesheet][Stylesheet]]
- [[#advanced-configuration][Advanced Configuration]]
  - [[#browser][Browser]]
  - [[#calculator][Calculator]]
  - [[#calendar][Calendar]]
  - [[#color-display-in-text][Color Display in Text]]
  - [[#dashboard][Dashboard]]
  - [[#which-key][Which Key]]
  - [[#helpful][Helpful]]
  - [[#indentations][Indentations]]
  - [[#linters][Linters]]
  - [[#parentheses][Parentheses]]
  - [[#pdf][PDF]]
  - [[#projectile][Projectile]]
  - [[#perspective][Perspective]]
  - [[#yasnippet][Yasnippet]]
  - [[#version-control][Version Control]]
  - [[#whitespace-and-kill][Whitespace and Kill]]
  - [[#undo-tree][Undo-tree]]
- [[#org-mode-configuration][Org Mode Configuration]]
- [[#agenda][Agenda]]
  - [[#bullets][Bullets]]
  - [[#capture][Capture]]
  - [[#clock][Clock]]
  - [[#contacts][Contacts]]
  - [[#faces][Faces]]
  - [[#encryptiondecryption][Encryption/Decryption]]
  - [[#journal][Journal]]
- [[#email][Email]]
- [[#ebooks][Ebooks]]
- [[#runtime-performance][Runtime Performance]]

* Emacs Initialization

Here we store our settings for correctly initializing GNU Emacs and it's subsystems.

** Startup Performance

The first thing we have to do is set the garbage collector to a higher memory value, in order for GNU Emacs to start faster.

#+begin_src emacs-lisp
  (setq gc-cons-threshold (* 100 1024 1024))
#+end_src

After GNU Emacs has started, we lower the value again. TODO: Add link to end.

** Package Manager

We aim to override the built-in =package.el= package manager and replace it with a much more powerful and modern alternative.
[[https://github.com/raxod502/straight.el][straight]] is our choice.

Firstly, we must configure the built-in package to not be enabled. We do that in the [[file:early-init.el::setq package-enable-at-startup nil][early-init.el]] file.
We use ~(setq package-enable-at-startup nil)~ to achieve that. (Only for Emacs >= 27)

After that step, we must install and bootstrap our new package manager.

#+begin_src emacs-lisp
  (defvar bootstrap-version)
  (let ((bootstrap-file
	 (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
	(bootstrap-version 5))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
	  (url-retrieve-synchronously
	   "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
	   'silent 'inhibit-cookies)
	(goto-char (point-max))
	(eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))
#+end_src

** Settings

=straight= provides integration with [[https://github.com/jwiegley/use-package][use-package]]. We first install is using ~(straight-use-package 'use-package)~ and
then set some defaults.
=straight-use-package-by-default= makes =use-package= install packages throught =straight= and also allows us to skip
the otherwise necessary ~:straight t~ command.
By default, we set all packages to not load until needed with ~use-package-always-defer t~. When we need for any
reason to override it, we can use ~:demand t~.

#+begin_src emacs-lisp
  (straight-use-package 'use-package)

  (setq straight-use-package-by-default t)
  (setq use-package-always-defer t)
#+end_src

Last thing we do, is suppress some warnings of =native-compilation=, since it's still new and a bit experimental.

#+begin_src emacs-lisp
  (setq comp-async-report-warnings-errors nil)
#+end_src

** Emacs Startup Debugging

We enable these when we need to debug our startup

#+begin_src emacs-lisp
  ;; (defun my/display-startup-time ()
  ;;   (message "⏱ Emacs loaded in %s with %d garbage collections."
  ;; 	   (format "%.2f seconds"
  ;; 		   (float-time
  ;; 		    (time-subtract after-init-time before-init-time)))
  ;; 	   gcs-done))

  ;; (add-hook 'emacs-startup-hook #'my/display-startup-time)

  ;; (setq use-package-verbose t)
#+end_src

** Keeping The Folder Clean

We use the package [[https://github.com/emacscollective/no-littering][no-littering]] to help us keep our main folder clean.

#+begin_src emacs-lisp
  (use-package no-littering
    :demand t
    :custom (auto-save-file-name-transforms
             `((".*" ,(no-littering-expand-var-file-name "auto-save/") t))))
#+end_src

** Authentication

#+begin_src emacs-lisp
  (use-package auth-source
    :straight nil
    :demand t
    :custom
    (auth-sources '("~/.config/gnupg/shared/authinfo.gpg"
                    "~/.authinfo.gpg"
                    "~/.authinfo"
                    "~/.netrc")))
#+end_src

** Better Defaults

We set some changed default values, for a better GNU Emacs experience.

#+begin_src emacs-lisp
  (setq-default
   ad-redefinition-action 'accept                      ; Silence warnings for redefinition.
   cursor-in-non-selected-windows t                    ;Hide the cursor in inactive windows.
   display-time-default-load-average nil               ; Don't display the load average.
   fill-column 120                                     ; Set width for automatic line break/wrap.
   help-window-select t                                ; Focus on new help windows when opened.
   indent-tabs-mode nil                                ; Use spaces over tabs.
   inhibit-startup-screen t                            ; Disable start-up screen.
   initial-scratch-message ""                          ; Clear the initial *scratch* buffer.
   kill-ring-max 128                                   ; Maximum length of the kill ring.
   mark-ring-max 128                                   ; Maximum length of the mark ring.
   load-prefer-newer t                                 ; Prefer the newest version of a file.
   read-process-output-max (* 1024 1024)               ; Increase the amount of data reads from the process.
   scroll-conservatively most-positive-fixnum          ; Always scroll by one line.
   select-enable-clipboard t                           ; Merge system's and Emacs' clipboards.
   tab-width 4                                         ; Set the width for tabs.
   user-full-name "Karolos Triantafyllou"              ; Set the full name of the current user.
   user-mail-address "karolos.triantafyllou@gmail.com" ; Set the email address of the current user.
   vc-follow-symlinks t                                ; Always follow the symlinks
   view-read-only t                                    ; Always open read-only buffers in view-mode.
   c-basic-offset 4                                    ; Set the base offset for C/C++.
   c-default-style "stroustrup")                       ; Set the default style of C/C++.
  (global-display-line-numbers-mode t)                 ; Show line numbers.
  (column-number-mode)                                 ; Show columns numbers in the modeline.
  (fset 'yes-or-no-p 'y-or-n-p)                        ; Replace yes/no prompts with y/n.
  (global-hl-line-mode)                                ; Highlight the current line.
  (set-default-coding-systems 'utf-8)                  ; Set default encoding to UTF-8.
  (show-paren-mode 1)                                  ; Show matching parentheses.
  (set-fringe-mode 10)                                 ; Set the left and right width in pixels
  ;; Disable line numbers for some modes
  (dolist (mode
           '(org-mode-hook
             term-mode-hook
             treemacs-mode-hook
             eshell-mode-hook
             vterm-mode-hook
             shell-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))
#+end_src

* UI Configuration

** Mouse Interface

With GNU Emacs, we focus on using only the keyboard. Every other element is disabled.

#+begin_src emacs-lisp
  (when window-system
    (scroll-bar-mode -1)   ; Disable visible scrollbar
    (tool-bar-mode -1)     ; Disable the toolbar
    (tooltip-mode -1)      ; Disable tooltips
    (menu-bar-mode -1))     ; Disable menu bar
#+end_src

** Fonts

Set our favorite fonts! We just must make sure the font is installed on the system

#+begin_src emacs-lisp
  ;; Set default font
  (set-face-attribute 'default nil :font "Iosevka" :height 110)
  ;; Set fixed pitch face
  (set-face-attribute 'fixed-pitch nil :font "Iosevka")
  ;; Set emoji font
  (set-fontset-font t 'symbol (font-spec :family "Noto Color Emoji") nil 'prepend)
  ;; Set variable pitch face
  (set-face-attribute 'variable-pitch nil :font "Cantarell" :weight 'regular :height 1.35)
#+end_src

*** Mixed Pitch Fonts

In order to used multiple fonts, we use the the package [[https://gitlab.com/jabranham/mixed-pitch][mixed-pitch]].

#+begin_src emacs-lisp
  (use-package mixed-pitch
    :hook (text-mode . mixed-pitch-mode))
#+end_src

