emacs/.config/emacs/init.el
(setq gc-cons-threshold (* 100 1024 1024))

(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
	(url-retrieve-synchronously
	 "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
	 'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

(straight-use-package 'use-package)

(setq straight-use-package-by-default t)
(setq use-package-always-defer t)

(setq comp-async-report-warnings-errors nil)

;; (defun my/display-startup-time ()
;;   (message "⏱ Emacs loaded in %s with %d garbage collections."
;; 	   (format "%.2f seconds"
;; 		   (float-time
;; 		    (time-subtract after-init-time before-init-time)))
;; 	   gcs-done))

;; (add-hook 'emacs-startup-hook #'my/display-startup-time)

;; (setq use-package-verbose t)

(use-package no-littering
  :demand t
  :custom (auto-save-file-name-transforms
           `((".*" ,(no-littering-expand-var-file-name "auto-save/") t))))

(use-package auth-source
  :straight nil
  :demand
  :custom
  (auth-sources '("~/.config/gnupg/shared/authinfo.gpg"
                  "~/.authinfo.gpg"
                  "~/.authinfo"
                  "~/.netrc")))

(setq-default
 ad-redefinition-action 'accept                      ; Silence warnings for redefinition.
 cursor-in-non-selected-windows t                    ;Hide the cursor in inactive windows.
 display-time-default-load-average nil               ; Don't display the load average.
 fill-column 120                                     ; Set width for automatic line break/wrap.
 help-window-select t                                ; Focus on new help windows when opened.
 indent-tabs-mode nil                                ; Use spaces over tabs.
 inhibit-startup-screen t                            ; Disable start-up screen.
 initial-scratch-message ""                          ; Clear the initial *scratch* buffer.
 kill-ring-max 128                                   ; Maximum length of the kill ring.
 mark-ring-max 128                                   ; Maximum length of the mark ring.
 load-prefer-newer t                                 ; Prefer the newest version of a file.
 read-process-output-max (* 1024 1024)               ; Increase the amount of data reads from the process.
 scroll-conservatively most-positive-fixnum          ; Always scroll by one line.
 select-enable-clipboard t                           ; Merge system's and Emacs' clipboards.
 tab-width 4                                         ; Set the width for tabs.
 user-full-name "Karolos Triantafyllou"              ; Set the full name of the current user.
 user-mail-address "karolos.triantafyllou@gmail.com" ; Set the email address of the current user.
 vc-follow-symlinks t                                ; Always follow the symlinks
 view-read-only t                                    ; Always open read-only buffers in view-mode.
 c-basic-offset 4                                    ; Set the base offset for C/C++.
 c-default-style "stroustrup")                       ; Set the default style of C/C++.
(global-display-line-numbers-mode t)                 ; Show line numbers.
(column-number-mode)                                 ; Show columns numbers in the modeline.
(fset 'yes-or-no-p 'y-or-n-p)                        ; Replace yes/no prompts with y/n.
(global-hl-line-mode)                                ; Highlight the current line.
(set-default-coding-systems 'utf-8)                  ; Set default encoding to UTF-8.
(show-paren-mode 1)                                  ; Show matching parentheses.
(set-fringe-mode 10)                                 ; Set the left and right width in pixels
;; Disable line numbers for some modes
(dolist (mode
         '(org-mode-hook
           term-mode-hook
           treemacs-mode-hook
           eshell-mode-hook
           vterm-mode-hook
           shell-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))

(when window-system
  (scroll-bar-mode -1)   ; Disable visible scrollbar
  (tool-bar-mode -1)     ; Disable the toolbar
  (tooltip-mode -1)      ; Disable tooltips
  (menu-bar-mode -1))     ; Disable menu bar

;; Set default font
(set-face-attribute 'default nil :font "Fira Code")
;; Set fixed pitch face
(set-face-attribute 'fixed-pitch nil :font "Fira Code")
;; Set emoji font
(set-fontset-font t 'symbol (font-spec :family "Noto Color Emoji") nil 'prepend)
;; Set variable pitch face
(set-face-attribute 'variable-pitch nil :font "Cantarell" :weight 'regular :height 1.3)

(use-package mixed-pitch
  :hook (text-mode . mixed-pitch-mode))
