emacs/.config/emacs/config.org
*** Ligatures

Since GNU Emacs doesn't automatically enable ligatures, we enable them ourselves. We will use =straight= to clone the [[https://github.com/mickeynp/ligature.el][repo]] directly.

#+begin_src emacs-lisp
  (use-package ligature
    :straight (ligature :type git :host github :repo
                        "mickeynp/ligature.el" :branch "master")
    :demand t
    :config
    ;; Enable the "www" ligature in every possible major mode
    (ligature-set-ligatures 't '("www"))
    ;; Enable traditional ligature support in eww-mode, if the
    ;; `variable-pitch' face supports it
    (ligature-set-ligatures 'eww-mode '("ff" "fi" "ffi"))
    ;; Enable all Cascadia Code ligatures in programming modes
    (ligature-set-ligatures 'prog-mode '("|||>" "<|||" "<==>" "<!--" "####" "~~>" "***" "||=" "||>"
                     ":::" "::=" "=:=" "===" "==>" "=!=" "=>>" "=<<" "=/=" "!=="
                     "!!." ">=>" ">>=" ">>>" ">>-" ">->" "->>" "-->" "---" "-<<"
                     "<~~" "<~>" "<*>" "<||" "<|>" "<$>" "<==" "<=>" "<=<" "<->"
                     "<--" "<-<" "<<=" "<<-" "<<<" "<+>" "</>" "###" "#_(" "..<"
                     "..." "+++" "/==" "///" "_|_" "www" "&&" "^=" "~~" "~@" "~="
                     "~>" "~-" "**" "*>" "*/" "||" "|}" "|]" "|=" "|>" "|-" "{|"
                     "[|" "]#" "::" ":=" ":>" ":<" "$>" "==" "=>" "!=" "!!" ">:"
                     ">=" ">>" ">-" "-~" "-|" "->" "--" "-<" "<~" "<*" "<|" "<:"
                     "<$" "<=" "<>" "<-" "<<" "<+" "</" "#{" "#[" "#:" "#=" "#!"
                     "##" "#(" "#?" "#_" "%%" ".=" ".-" ".." ".?" "+>" "++" "?:"
                     "?=" "?." "??" ";;" "/*" "/=" "/>" "//" "__" "~~" "(*" "*)"
                     "\\\\" "://"))
    ;; Enables ligature checks globally in all buffers. You can also do it
    ;; per mode with `ligature-mode'.
    (global-ligature-mode t))
#+end_src

** Theme

#+begin_src emacs-lisp
  (use-package doom-themes
    :demand t
    :config
    (load-theme 'doom-nord t)
    (doom-themes-visual-bell-config)
    (setq doom-themes-treemacs-theme "doom-colors")
    (doom-themes-treemacs-config)
    (doom-themes-org-config))
#+end_src

Solaire-mode can help us differentiate between our actual buffers, from ones that are informative or pop-ups, by giving the latter a darker color.

#+begin_src emacs-lisp
  (use-package solaire-mode
    :demand t
    :custom (solaire-mode-remap-fringe t)
    :config (solaire-global-mode))
#+end_src

** Modeline

#+begin_src emacs-lisp
  (use-package doom-modeline
    :demand t
    :init (doom-modeline-mode)
    :custom
    (doom-modeline-icon (display-graphic-p))
   (doom-modeline-mu4e t)
   (mu4e-alert-enable-mode-line-display))
#+end_src

** Icons

Some icons will always make things prettier

*** All The Icons

[[https://github.com/domtronn/all-the-icons.el][all-the-icons]] is the defacto standard for inserting icons in almost everywhere. If the config does not work, we must install the icons with ~all-the-icons-install-fonts~

#+begin_src  emacs-lisp
  (use-package all-the-icons
    :if (display-graphic-p)
    :commands all-the-icons-install-fonts
    :config (unless (find-font (font-spec :name "all-the-icons"))
              (all-the-icons-install-fonts t)))
#+end_src

*** All The Icons Dired

#+begin_src emacs-lisp
  (use-package all-the-icons-dired
    :if (display-graphic-p)
    :hook (dired-mode . all-the-icons-dired-mode))
#+end_src

*** All The Icons Completion

[[https://github.com/iyefrat/all-the-icons-completion][all-the-icons-completion]] adds icons to =marginalia= / =vertico=.

#+begin_src emacs-lisp
    (use-package all-the-icons-completion
      :after (all-the-icons marginalia)
      :hook (marginalia-mode . all-the-icons-completion-marginalia-setup)
      :init
      (all-the-icons-completion-mode 1))
#+end_src

* Minibuffer Completion

** Vertico

We use =vertico=, because it is quite minimal and unintrusive.

#+begin_src emacs-lisp
  (use-package vertico
    :straight (:files (:defaults "extensions/*"))
    :init (vertico-mode)
    :custom (vertico-cycle t)
    :custom-face (vertico-current ((t (:background "#1d1f21")))))

  (use-package vertico-directory
    :after (vertico)
    :straight nil
    :bind (:map vertico-map
                ("C-<backspace>" . vertico-directory-up)))
#+end_src

** Marginalia

To enable richer annotations with =vertico= (e.g. summary documentation of the functions variables, as well as size and last consultation of the files), we use [[https://github.com/minad/marginalia/][marginalia]].

 #+begin_src emacs-lisp
   (use-package marginalia
     :after vertico
     :init (marginalia-mode)
     :bind (:map minibuffer-local-map
                 ("M-A" . marginalia-cycle))
     :custom
     (marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil)))
#+end_src

** Orderless

By default, =vertico= sorts the candidates according to their history position, then length and finally alphabetically. To improve searching across completion, we use [[https://github.com/oantolin/orderless][orderless]].

#+begin_src emacs-lisp
  (use-package orderless
    :after (vertico marginalia)
    :custom
    (completion-category-defaults nil)
    (completion-category-overrides '((file (styles . (partial-completion)))))
    (completion-styles '(orderless)))
#+end_src

** Consult

To further enrich our minibuffer with commands, [[https://github.com/minad/consult][consult]] is the package of choice.

#+begin_src emacs-lisp
  (use-package consult
    :after (projectile)
    :bind (;; Related to control commands
           ("<help> a" . consult-apropos)
           ("C-x b" . consult-buffer)
           ("C-x M-:" . consult-complex-command)
           ("C-c k" . consult-kmacro)
           ;; Related to navigation
           ("M-g a" . consult-org-agenda)
           ("M-g e" . consult-error)
           ("M-g g" . consult-goto-line)
           ("M-g h" . consult-org-heading)
           ("M-g i" . consult-imenu)
           ("M-g k" . consult-global-mark)
           ("M-s l" . consult-line)
           ("M-g m" . consult-mark)
           ("M-g o" . consult-outline)
           ("M-g I" . consult-project-imenu)
           ;; Related to search and selection
           ("M-s G" . consult-git-grep)
           ("M-s g" . consult-grep)
           ("M-s k" . consult-keep-lines)
           ("M-s l" . consult-locate)
           ("M-s m" . consult-multi-occur)
           ("M-s r" . consult-ripgrep)
           ("M-s u" . consult-focus-lines)
           ("M-s f" . consult-find))
    :custom
    (completion-in-region-function #'consult-completion-in-region)
    (consult-narrow-key "<")
    (consult-project-root-function #'projectile-project-root)
    ;; Provides a consistent display for both '=consult-register=' and the register preview when editin registers.
    (register-preview-delay 0)
    (register-preview-function #'consult-register-preview))
#+end_src

** Embark

Finally, we can use [[https://github.com/oantolin/embark/][embark]] to interact directly on the files through the completion system.

#+begin_src emacs-lisp
  (use-package embark
    :bind ("C-." . embark-act))

  (use-package embark-consult
    :after (embark consult)
    :demand t
    :hook
    (embark-collect-mode . consult-preview-at-point-mode))
#+end_src

* Auto-Completion

Auto-completion in GNU Emacs is mainly combined with LSP mode.

** Company

We use [[https://github.com/company-mode/company-mode][company-mode]] as our completion front-end.

#+begin_src emacs-lisp
  (use-package company
    :after lsp-mode
    :hook (lsp-mode . company-mode)
    :custom
    (company-begin-commands '(self-insert-command))
    (company-idle-delay 0.5)
    (company-minimum-prefix-length 1)
    (company-show-quick-access t)
    (company-tooltip-align-annotations 't))
#+end_src

** Company Box

To get candidate icons and thus being able to differentiate a function from a variable at a glance, we use [[https://github.com/sebastiencs/company-box/][company-box]].

#+begin_src emacs-lisp
  (use-package company-box
    :if (display-graphic-p)
    :after company
    :hook (company-mode . company-box-mode))
#+end_src

* Language Servers

** LSP

#+begin_src emacs-lisp
  (use-package lsp-mode
    :commands (lsp lsp-deferred)
    :hook ((prog-mode . lsp-deferred)
           (lsp-mode . lsp-enable-which-key-integration))
    :custom
    (lsp-server-install-dir (expand-file-name (format "%s/etc/lsp" user-emacs-directory)))
    (lsp-keymap-prefix "C-c ;"))
#+end_src

#+begin_src emacs-lisp
  (use-package lsp-ui
    :hook (lsp-mode . lsp-ui-mode))
#+end_src

#+begin_src emacs-lisp
  (use-package lsp-treemacs
    :after lsp)
#+end_src

#+begin_src emacs-lisp
  (use-package dap-mode
    :after lsp-mode
    :config (dap-mode t)
    (dap-ui-mode t))
#+end_src

#+begin_src emacs-lisp
  (use-package consult-lsp
    :after (consult lsp)
    :commands (consult-lsp-diagnostics consult-lsp-symbols))
#+end_src

** Built-in Packages

*** Emacs

#+begin_src emacs-lisp
  (use-package emacs
    :straight nil
    :demand t
    :init
    (setq completion-cycle-threshold 3)
    (setq read-extended-command-predicate
      #'command-completion-default-include-p)
    (setq tab-always-indent 'complete))
#+end_src

#+begin_src emacs-lisp
;;  (when (equal tab-always-indent 'complete)
;;    (define-key c-mode-base-map [remap c-indent-line-or-region] #'completion-at-point))
#+end_src

* Meson

Meson is a build system for C/C++ and some other languages.

#+begin_src emacs-lisp
    (use-package meson-mode
      :hook (meson-mode . company-mode))
#+end_src

* File Management

