emacs/.config/emacs/config.org
** Dired

#+begin_src emacs-lisp
  (use-package dired
    :straight nil
    :commands (dired dired-jump)
    :bind (:map dired-mode-map
		("h" . dired-up-directory)
		("j" . dired-next-line)
		("k" . dired-previous-line)
		("l" . dired-single-buffer))
    :delight "Dired"
    :custom
    (dired-auto-revert-buffer t)
    (dired-dwim-target t)
    (dired-hide-details-hide-symlink-targets nil)
    (dired-listing-switches "-alh --group-directories-first")
    (dired-ls-F-marks-symlinks nil)
    (dired-recursive-copies 'always))
#+end_src

We can peek inside a folder with =<TAB>= using [[https://github.com/Fuco1/dired-hacks/blob/master/dired-subtree.el][dired-subtree]].

#+begin_src emacs-lisp
  (use-package dired-subtree
    :after dired
    :bind (:map dired-mode-map
		("<tab>" . dired-subtree-toggle)))
#+end_src

To avoid having =dired= keep buffers, we use [[https://github.com/crocket/dired-single][dired-single]].

#+begin_src emacs-lisp
  (use-package dired-single
    :after dired
    :bind (:map dired-mode-map
		([remap dired-find-file] . dired-single-buffer)
		([remap dired-up-directory] . dired-single-up-directory)
		("M-DEL" . dired-prev-subdir)))
#+end_src

Sometimes we might want to hide dotfiles. With [[https://github.com/mattiasb/dired-hide-dotfiles][dired-hide-dotfiles]], this becomes trivial.

#+begin_src emacs-lisp
  (use-package dired-hide-dotfiles
    :hook (dired-mode . dired-hide-dotfiles-mode)
    :bind (:map dired-mode-map
		("H" . dired-hide-dotfiles-mode)))
#+end_src

By default, =dired= opens files in plain text. This behavior is sometimes undesirable. Thankfully, [[https://github.com/Fuco1/dired-hacks/blob/master/dired-open.el][dired-open]] can be used to inform =dired= of certain file extensions that must be opened with external packages/applications.

#+begin_src emacs-lisp
  (use-package dired-open
    :after (dired dired-jump)
    :custom (dired-open-extensions '(("mp4" . "mpv"))))
#+end_src

Finally, in order to manage folders with large amounts of files, we can filter it with [[https://github.com/Fuco1/dired-hacks/blob/master/dired-narrow.el][dired-narrow]].

#+begin_src emacs-lisp
  (use-package dired-narrow
    :straight nil
    :bind (("C-c C-n" . dired-narrow)
           ("C-c C-f" . dired-narrow-fuzzy)))
#+end_src

* Buffer management

** IBuffer

#+begin_src emacs-lisp
  (use-package ibuffer
    :demand t
    :preface
    (defvar protected-buffers '("*scratch*" "*Messages*")
      "Buffers that cannot be killed.")
    (defun my/protected-buffers ()
      "Protects some buffers from being killed."
      (dolist (buffer protected-buffers)
    (with-current-buffer buffer
      (emacs-lock-mode 'kill)))))
#+end_src

** IMenu

#+begin_src emacs-lisp
  (use-package imenu
    :straight nil
    :preface
    (defun my/smarter-move-beginning-of-line (arg)
      "Move point back to indentation of beginning of line.

   Move point to the first non-whitespace character on this line.
   If point is already there, move to the beginning of the line.
   Effectively toggle between the first non-whitespace character and
   the beginning of the line.

   If ARG is not nil or 1, move forward ARG - 1 lines first. If
   point reaches the beginning or end of the buffer, stop there."
      (interactive "^p")
      (setq arg (or arg 1))

      ;; Move lines first
      (when (/= arg 1)
        (let ((line-move-visual nil))
          (forward-line (1- arg))))

      (let ((orig-point (point)))
        (back-to-indentation)
        (when (= orig-point (point))
          (move-beginning-of-line 1))))
    :bind (("C-a" . my/smarter-move-beginning-of-line)
           ("C-r" . imenu)))
#+end_src

** Move Text

#+begin_src emacs-lisp
  (use-package move-text
    :bind (("M-p" . move-text-up)
           ("M-n" . move-text-down))
    :config (move-text-default-bindings))
#+end_src

** Auto-revert

#+begin_src emacs-lisp
  (use-package autorevert
    :straight nil
    :demand t
    :delight auto-revert-mode
    :bind ("C-x R" . revert-buffer)
    :custom (auto-revert-verbose nil)
    :config (global-auto-revert-mode))
#+end_src

* Windows

** Window

Most of the times, when we split a window, we want to focus it and perform some action. Unfortunately, GNU Emacs does not default to this behavior.

#+begin_src emacs-lisp
  (use-package window
    :straight nil
    :demand t
    :bind (("C-x 3" . hsplit-last-buffer)
           ("C-x 2" . vsplit-last-buffer)
           ;; Don't ask before killing a buffer.
           ([remap kill-buffer] . kill-this-buffer))
    :preface
    (defun hsplit-last-buffer ()
      "Gives the focus to the last created horizontal window."
      (interactive)
      (split-window-horizontally)
      (other-window 1))
    (defun vsplit-last-buffer ()
      "Gives the focus to the last created vertical window."
      (interactive)
      (split-window-vertically)
      (other-window 1)))
#+end_src

** Centered window

Sole windows are centered within GNU Emacs with the help of [[https://github.com/anler/centered-window-mode][centered-window]].

#+begin_src emacs-lisp
  (use-package centered-window
    :demand t
    :custom
    (cwm-centered-window-width 140)
    (cwm-frame-internal-border 0)
    (cwm-incremental-padding t)
    (cwm-incremental-padding-% 2)
    (cwm-left-fringe-ratio 0)
    (cwm-use-vertical-padding t)
    :config (centered-window-mode t))
#+end_src

** Switch Window

When we have multiple windows open in GNU Emacs, we can move around them by indicating a unique number and typing that. [[https://github.com/dimitri/switch-window][switch-window]] gives us the tools to do so, while also hiding the contents of each window.

#+begin_src emacs-lisp
(use-package switch-window
    :bind (("C-x o" . switch-window)
           ("C-x w" . switch-window-then-swap-buffer)))
#+end_src

** Winner

Sometimes, we would like to bring back a window layout with their content. We can use the built-in package =winner= and specifically =winner-undo= and =winner-redo= commands.

#+begin_src emacs-lisp
  (use-package winner
    :straight nil
    :demand t
    :config (winner-mode))
#+end_src

* Terminals

** Term

#+begin_src emacs-lisp
  (use-package term
    :commands term
    :config
    (setq explicit-shell-file-name "zsh")
    (setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *"))
#+end_src

** E-Term

#+begin_src emacs-lisp
  (use-package eterm-256color
    :hook (term-mode . eterm-256color-mode))
#+end_src

** VTerm

#+begin_src emacs-lisp
  (use-package vterm
    :commands vterm
    :config
    (setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *")
    (setq vterm-shell "zsh")
    (setq vterm-max-scrollback 10000))
#+end_src

** EShell

#+begin_src emacs-lisp
  (use-package eshell)
#+end_src

* Spelling

In order to check our spelling and grammar, we will use =abbrev=, =flyspell=, =ispell= and =LanguageTool=.

** Abbreviations

We can correct commonly misspelled words with the built-in =abbrev= package. Of course, we have to provide the list in a file.

#+begin_src emacs-lisp
  (use-package abbrev
    :straight nil
    :delight
    :hook (text-mode . abbrev-mode)
    :config
    (if (file-exists-p abbrev-file-name)
        (quietly-read-abbrev-file)))
#+end_src

** Flyspell

For more general spelling mistakes, we use the built-in =flyspell= package, to enable on-the-fly spell checking. A common command is =flyspelll-auto-correct-word= (=M-<TAB>=) which automatically corrects a word according to the best suggestion.

*NOTE:* a call to ~flyspell-buffer~ could be extremely slow.

#+begin_src emacs-lisp
  (use-package flyspell
    :straight nil
    :delight
    :hook ((text-mode . flyspell-mode)
           (prog-mode . flyspell-prog-mode))
    :custom
    ;; Add correction to abbreviation table.
    (flyspell-abbrev-p t)
    (flyspell-default-dictionary "en_US")
    (flyspell-issue-message-flag nil)
    (flyspell-issue-welcome-flag nil))
#+end_src

