emacs/.config/emacs/config.org
** Spell Checker

To correct spelling mistakes, the =ispell= package needs to use a spell checker package, like [[https://github.com/hunspell/hunspell][hunspell]] or [[https://github.com/GNUAspell/aspell][aspell]].

To use =hunspell=, we need to install it with our system's package manager, together with any desired language dictionaries (e.g. =hunspell-en_US= and =hunspell-el=).

Then we can check that the dictionaries have installed (and where) using the ~hunspell -D~ command.

#+begin_src emacs-lisp
  (use-package ispell
    :preface
    (defun my/switch-language ()
      "Switches between the English and Greek language for ispell, flyspell and LanguageTool."
      (interactive)
      (let* ((current-dictionary ispell-current-dictionary)
             (new-dictionary (if (string= current-dictionary "en_US") "el_GR" "en_US")))
        (ispell-change-dictionary new-dictionary)
        (if (string= new-dictionary "el_GR")
            (progn
              (setq lsp-ltex-language "el"))
          (progn
            (setq lsp-ltex-language "en-US")))
        (flyspell-buffer)
        (message "[✓] Dictionary switched to %s" new-dictionary)))
    :custom
    (ispell-hunspell-dict-paths-alist
   '(("en_US" "/usr/share/hunspell/en_US.aff")
     ("el_GR" "/usr/share/hunspell/el_GR.aff")))
  ;; Save words in personal dictionary without asking
  (ispell-silently-savep t)
  :config
  (setenv "LANG" "en_US")
  (cond ((executable-find "hunspell")
         (setq ispell-program-name "hunspell")
         (setq ispell-local-dictionary-alist '(("en_US"
                                                "[[:alpha:]]"
                                                "[^[:alpha:]]"
                                                "['’-]"
                                                t
                                                ("-d" "en_US")
                                                nil
                                                utf-8)
                                               ("el_GR" "[[:alpha:]ΒΓΔΖΘΛΞΠΣΦΨΩαάβγδεέζηήθιίϊκλμνξοόπρσςτυύϋφχψωώ]" "[^[:alpha:]ΒΓΔΖΘΛΞΠΣΦΨΩαάβγδεέζηήθιίϊκλμνξοόπρσςτυύϋφχψωώ]"
                                                "['’-]"
                                                t
                                                ("-d" "el_GR")
                                                nil
                                                utf-8))))
        ((executable-find "aspell")
         (setq ispell-program-name "aspell")
         (setq ispell-extra-args '("--sug-mode=ultra"))))
  ;; Ignore file sections for spell checking.
  (add-to-list 'ispell-skip-region-alist '("#\\+begin_align" . "#\\+end_align"))
  (add-to-list 'ispell-skip-region-alist '("#\\+begin_align*" . "#\\+end_align*"))
  (add-to-list 'ispell-skip-region-alist '("#\\+begin_equation" . "#\\+end_equation"))
  (add-to-list 'ispell-skip-region-alist '("#\\+begin_equation*" . "#\\+end_equation*"))
  (add-to-list 'ispell-skip-region-alist '("#\\+begin_example" . "#\\+end_example"))
  (add-to-list 'ispell-skip-region-alist '("#\\+begin_labeling" . "#\\+end_labeling"))
  (add-to-list 'ispell-skip-region-alist '("#\\+begin_src" . "#\\+end_src"))
  (add-to-list 'ispell-skip-region-alist '("\\$" . "\\$"))
  (add-to-list 'ispell-skip-region-alist '(org-property-drawer-re))
  (add-to-list 'ispell-skip-region-alist '(":\\(PROPERTIES\\|LOGBOOK\\):" . ":END:")))
#+end_src

** Grammar Checker

[[https://languagetool.org/][LanguageTool]] is great for correcting our grammar while we are writing or saving a buffer. Combined with =abbrev-mode= and =flyspell=, we can have better quality documents. To integrate =LanguageTool= with LSP, we will need [[https://github.com/emacs-languagetool/lsp-ltex][lsp-ltex]]. The first time we use it, it will download the [[https://github.com/valentjn/ltex-ls][LTEX Language Server]] LSP server for us.

*NOTE:* We won't hook =lsp-ltex= to =text-mode= to avoid it processing our =config.org= file, since it's so big and might have too many errors to properly process.

#+begin_src emacs-lisp
  (use-package lsp-ltex
    :init
    (setq lsp-ltex-version "15.2.0")
    :custom
    ;;(lsp-ltex-enabled nil)
    (lsp-ltex-mother-tongue "en-US"))
#+end_src

* Programming Languages and Tools

** Bash

Using UNIX, bash is an easy way to script, and it's natively supported by GNU Emacs. For some extra help, we use [[https://emacs-lsp.github.io/lsp-mode/page/lsp-bash/][bash-language-server]] (=bash-ls=) as an LSP server.

This snippet ensures that shell script files that begin with a ~#!~ shebang will be automatically granted execution rights (~chmod +x~).

#+begin_src emacs-lisp
  (use-package sh-script
    :straight nil
    :hook (after-save . executable-make-buffer-file-executable-if-script-p))
#+end_src

** C++

For C++, we use [[https://clangd.llvm.org/][clangd]] which integrates natively with LSP. We can either let LSP download the server, or use our system's package manager to download LLVM (clang, clangd, etc.).

Configuration is stored (at least for now) in a separate file at =%XDG_CONFIG_HOME/clangd/config.yaml=.
Individual projects can use their own =.clangd= file for extra options or overrides.

=clangd= needs a =compile_commands.json= file in order to know the dependencies of our =.cpp= with our =.h/.hpp= files. For that, [[Meson][Meson]] creates one itself in the build directory, or we can use [[https://github.com/rizsotto/Bear][Build EAR]] for simpler projects.

** CMake

Although CMake will never be directly used, it is sometimes handy to get all expected features, as well as syntax highlighting to ease the eyes. We will additionally need the =cmake-language-server=.

#+begin_src emacs-lisp
  (use-package cmake-mode
    :hook (cmake-mode . lsp-deferred)
    :mode ("CMakeLists\\.txt\\'" "\\.cmake\\'"))
#+end_src

#+begin_src emacs-lisp
  (use-package cmake-font-lock
    :hook (cmake-mode . cmake-font-lock-activate))
#+end_src

If we ever wanted to change =Meson=, we could use [[https://github.com/atilaneves/cmake-ide/blob/master/cmake-ide.el][cmake-ide]].

** CSV

=csv-mode= provides a nice syntax highlight of CSV files.

#+begin_src emacs-lisp
  (use-package csv-mode :mode ("\\.\\(csv\\|tsv\\)\\'"))
#+end_src

** JSON

#+begin_src emacs-lisp
(use-package json-mode
  :delight "J "
  :mode "\\.json\\'"
  :hook (before-save . my/json-mode-before-save-hook)
  :preface
  (defun my/json-mode-before-save-hook ()
    (when (eq major-mode 'json-mode)
      (json-pretty-print-buffer)))

  (defun my/json-array-of-numbers-on-one-line (encode array)
    "Prints the arrays of numbers in one line."
    (let* ((json-encoding-pretty-print
            (and json-encoding-pretty-print
                 (not (loop for x across array always (numberp x)))))
           (json-encoding-seperator (if json-encoding-pretty-print "," ", ")))
      (funcall encode array)))
  :config (advice-add 'json-encode-array :around #'my/json-array-of-numbers-on-one-line))
#+end_src

** Stylesheet

Since GNU Emacs already has good built-in packages for stylesheet languages (e.g. CSS, LESS, SCSS), we only need to install an appropriate LSP server. The best one is [[https://github.com/vscode-langservers/vscode-css-languageserver][vscode-css-languageserver]] (=css-ls=), even though it does not support the LESS language.

#+begin_src emacs-lisp
  (use-package css-mode
    :after flycheck
    :mode "\\.css\\'"
    :custom (css-indent-offset 2)
    (flycheck-stylelintrc "~/Programming/web/.stylelintrc.json"))

  (use-package scss-mode
    :after (flycheck lsp)
    :hook (scss-mode . lsp)
    :mode "\\.scss\\'"
    :config (setq scss-sass-command dart-p))
#+end_src

* Advanced Configuration

** Browser

GNU Emacs provides the =browse-url= package to open a browser within itself. Even though using a dedicated browser is preferred, sometimes it is useful to not leave from the environment.

#+begin_src emacs-lisp
  (use-package browse-url
    :straight nil
    :custom
    (browse-url-browser-function 'browse-url-generic)
    (browse-url-generic-program "firefox"))
#+end_src

** Calculator

Sometimes, we might need to do calculations and conversions. With the built-in =calc= package (=C-x * c=), we can do it from within GNU Emacs.

Some useful commands to know within =calc= are:
- =calc-algebraic-entry= :: allows us to enter a value and its unit to later convert it or associate it with an operation.
- =calc-convert-units= (=u c=) :: converts the output of an algebraic entry (e.g. =25m= → =25000mm=).
- =calc-simplify-units= (=u s=) :: simplifies the output of and algebraic entry (e.g. =5 m + 23 cm= → =5.023 m=).
- =calc-view-units-table= (=u V=) :: displays a table of units supported by =calc=.

#+begin_src emacs-lisp
  (use-package calc
    :straight nil
    :custom
    (math-additional-units
     '((GiB "1024 * MiB" "Giga Byte")
       (MiB "1024 * KiB" "Mega Byte")
       (KiB "1024 * B" "Kilo Byte")
       (B nil "Byte")
       (Gib "1024 * Mib" "Giga Bit")
       (Mib "1024 * Kib" "Mega Bit")
       (Kib "1024 * b" "Kilo Bit")
       (b "B / 8" "Bit")))
    ;; Resets the calc's cache
    (math-units-table nil))
#+end_src

