emacs/.config/emacs/init.el

(use-package ispell
  :preface
  (defun my/switch-language ()
    "Switches between the English and Greek language for ispell, flyspell and LanguageTool."
    (interactive)
    (let* ((current-dictionary ispell-current-dictionary)
           (new-dictionary (if (string= current-dictionary "en_US") "el_GR" "en_US")))
      (ispell-change-dictionary new-dictionary)
      (if (string= new-dictionary "el_GR")
          (progn
            (setq lsp-ltex-language "el"))
        (progn
          (setq lsp-ltex-language "en-US")))
      (flyspell-buffer)
      (message "[✓] Dictionary switched to %s" new-dictionary)))
  :custom
  (ispell-hunspell-dict-paths-alist
 '(("en_US" "/usr/share/hunspell/en_US.aff")
   ("el_GR" "/usr/share/hunspell/el_GR.aff")))
;; Save words in personal dictionary without asking
(ispell-silently-savep t)
:config
(setenv "LANG" "en_US")
(cond ((executable-find "hunspell")
       (setq ispell-program-name "hunspell")
       (setq ispell-local-dictionary-alist '(("en_US"
                                              "[[:alpha:]]"
                                              "[^[:alpha:]]"
                                              "['’-]"
                                              t
                                              ("-d" "en_US")
                                              nil
                                              utf-8)
                                             ("el_GR" "[[:alpha:]ΒΓΔΖΘΛΞΠΣΦΨΩαάβγδεέζηήθιίϊκλμνξοόπρσςτυύϋφχψωώ]" "[^[:alpha:]ΒΓΔΖΘΛΞΠΣΦΨΩαάβγδεέζηήθιίϊκλμνξοόπρσςτυύϋφχψωώ]"
                                              "['’-]"
                                              t
                                              ("-d" "el_GR")
                                              nil
                                              utf-8))))
      ((executable-find "aspell")
       (setq ispell-program-name "aspell")
       (setq ispell-extra-args '("--sug-mode=ultra"))))
;; Ignore file sections for spell checking.
(add-to-list 'ispell-skip-region-alist '("#\\+begin_align" . "#\\+end_align"))
(add-to-list 'ispell-skip-region-alist '("#\\+begin_align*" . "#\\+end_align*"))
(add-to-list 'ispell-skip-region-alist '("#\\+begin_equation" . "#\\+end_equation"))
(add-to-list 'ispell-skip-region-alist '("#\\+begin_equation*" . "#\\+end_equation*"))
(add-to-list 'ispell-skip-region-alist '("#\\+begin_example" . "#\\+end_example"))
(add-to-list 'ispell-skip-region-alist '("#\\+begin_labeling" . "#\\+end_labeling"))
(add-to-list 'ispell-skip-region-alist '("#\\+begin_src" . "#\\+end_src"))
(add-to-list 'ispell-skip-region-alist '("\\$" . "\\$"))
(add-to-list 'ispell-skip-region-alist '(org-property-drawer-re))
(add-to-list 'ispell-skip-region-alist '(":\\(PROPERTIES\\|LOGBOOK\\):" . ":END:")))

(use-package lsp-ltex
  :init
  (setq lsp-ltex-version "15.2.0")
  :custom
  ;;(lsp-ltex-enabled nil)
  (lsp-ltex-mother-tongue "en-US"))

(use-package sh-script
  :straight nil
  :hook (after-save . executable-make-buffer-file-executable-if-script-p))

(use-package cmake-mode
  :hook (cmake-mode . lsp-deferred)
  :mode ("CMakeLists\\.txt\\'" "\\.cmake\\'"))

(use-package cmake-font-lock
  :hook (cmake-mode . cmake-font-lock-activate))

(use-package csv-mode :mode ("\\.\\(csv\\|tsv\\)\\'"))

(use-package json-mode
  :delight "J "
  :mode "\\.json\\'"
  :hook (before-save . my/json-mode-before-save-hook)
  :preface
  (defun my/json-mode-before-save-hook ()
    (when (eq major-mode 'json-mode)
      (json-pretty-print-buffer)))

  (defun my/json-array-of-numbers-on-one-line (encode array)
    "Prints the arrays of numbers in one line."
    (let* ((json-encoding-pretty-print
            (and json-encoding-pretty-print
                 (not (loop for x across array always (numberp x)))))
           (json-encoding-seperator (if json-encoding-pretty-print "," ", ")))
      (funcall encode array)))
  :config (advice-add 'json-encode-array :around #'my/json-array-of-numbers-on-one-line))

(use-package css-mode
  :after flycheck
  :mode "\\.css\\'"
  :custom (css-indent-offset 2)
  (flycheck-stylelintrc "~/Programming/web/.stylelintrc.json"))

(use-package scss-mode
  :after (flycheck lsp)
  :hook (scss-mode . lsp)
  :mode "\\.scss\\'"
  :config (setq scss-sass-command dart-p))

(use-package browse-url
  :straight nil
  :custom
  (browse-url-browser-function 'browse-url-generic)
  (browse-url-generic-program "firefox"))

(use-package calc
  :straight nil
  :custom
  (math-additional-units
   '((GiB "1024 * MiB" "Giga Byte")
     (MiB "1024 * KiB" "Mega Byte")
     (KiB "1024 * B" "Kilo Byte")
     (B nil "Byte")
     (Gib "1024 * Mib" "Giga Bit")
     (Mib "1024 * Kib" "Mega Bit")
     (Kib "1024 * b" "Kilo Bit")
     (b "B / 8" "Bit")))
  ;; Resets the calc's cache
  (math-units-table nil))
