emacs/.config/emacs/init.el
  :mode ("\\.epub\\'" . nov-mode))

(setq gc-cons-threshold (* 10 1000 1000))
